using System.Collections.Generic;
namespace VEM.Business.Util
{
    public enum StatusCode
    {
        操作成功 = 0x0000,
        //账号相关
        用户名或密码不正确 = 0x1001,
        账号已禁用 = 0x1002,
        原密码不正确 = 0x1003,
        电话号已被注册 = 0x1004,
        电子邮件已被注册 = 0x1005,
        用户名已被注册 = 0x1006,
        没有登录 = 0x1007,
        //1.数据监控

        //2.售货机管理

        销售记录非空 = 0x2001,
        货道未清空 = 0x2002,
        已存在此型号的售货机 = 0x2003,

        //3.商品管理
        没有选择商品 = 0x3001,
        商品已添加到货道中 = 0x3002,
        //4.个人信息管理
        已有会员使用此优惠券 = 0x4001,

        //5.权限管理
        此菜单下没有Button按钮 = 0x5001,

        //6.系统设置
        此区县已被引用 = 0x6001,
        此城市已被引用 = 0x6002,
        子菜单非空 = 0x6003,
        按钮非空 = 0x6004,

        失败 = 0x8000,
        没有执行 = 0x8001,
        未知错误 = 0x8FFF
    }
}
