var STATUS = {
    0x0000:"操作成功",
    0x1001:"用户名或密码不正确",
    0x1002:"账号已禁用",
    0x1003:"原密码不正确",
    0x1004:"电话号已被注册",
    0x1005:"电子邮件已被注册",
    0x1006:"用户名已被注册",
    0x1007:"没有登录",

    0x2001: "售货机存在销售记录",
    0x2002: "货道未清空",
    0x2003: "已存在此型号的售货机，不允许删除",

    0x3001: "必须选择一个商品",
    0x3002: "商品已添加到货道中，不允许删除",

    0x4001: "已有会员正在使用此优惠券，不允许删除",

    0x5001: "此菜单下没有Button按钮",

    0x6001: "此区县已被引用，不允许删除",
    0x6002: "此城市已被引用，不允许删除",
    0x6003: "存在子菜单，不允许删除",
    0x6004: "此菜单下存在按钮，不允许删除",

    0x8000:"失败",
    0x8001:"没有执行",
    0x8FFF: "未知错误"

}